services/device-loan/load-test.yml
# Load Testing Configuration for Device Loan Service
# Using Artillery.io for load testing

config:
  target: "{{ $processEnvironment.FUNCTION_APP_URL }}"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up load"
    
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load phase
    - duration: 120
      arrivalRate: 100
      name: "Peak load"
    
    # Cool-down phase
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"
  
  processor: "./load-test-functions.js"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 5  # Max 5% error rate
    p95: 2000        # 95th percentile response time < 2s
    p99: 5000        # 99th percentile response time < 5s

  # Variables for test data
  variables:
    userId: 
      - "user-001"
      - "user-002"
      - "user-003"
      - "user-004"
      - "user-005"
    deviceId:
      - "device-001"
      - "device-002"
      - "device-003"
      - "device-004"
      - "device-005"

scenarios:
  # Scenario 1: Create Loan Flow
  - name: "Create Loan"
    weight: 40
    flow:
      - post:
          url: "/api/loans"
          headers:
            Content-Type: "application/json"
            X-User-ID: "{{ userId }}"
          json:
            userId: "{{ userId }}"
            deviceId: "{{ deviceId }}"
            loanDate: "{{ $randomString() }}"
            dueDate: "{{ $randomString() }}"
          capture:
            - json: "$.loanId"
              as: "loanId"
          expect:
            - statusCode: 201
  
  # Scenario 2: List Loans
  - name: "List Loans"
    weight: 30
    flow:
      - get:
          url: "/api/loans?userId={{ userId }}"
          headers:
            X-User-ID: "{{ userId }}"
          expect:
            - statusCode: 200
            - contentType: json
  
  # Scenario 3: Get Loan by ID
  - name: "Get Loan by ID"
    weight: 15
    flow:
      - post:
          url: "/api/loans"
          headers:
            Content-Type: "application/json"
          json:
            userId: "{{ userId }}"
            deviceId: "{{ deviceId }}"
          capture:
            - json: "$.loanId"
              as: "loanId"
      - get:
          url: "/api/loans/{{ loanId }}"
          expect:
            - statusCode: 200
  
  # Scenario 4: Cancel Loan
  - name: "Cancel Loan"
    weight: 10
    flow:
      - post:
          url: "/api/loans"
          headers:
            Content-Type: "application/json"
          json:
            userId: "{{ userId }}"
            deviceId: "{{ deviceId }}"
          capture:
            - json: "$.loanId"
              as: "loanId"
      - put:
          url: "/api/loans/{{ loanId }}/cancel"
          headers:
            Content-Type: "application/json"
          json:
            reason: "Load test cancellation"
          expect:
            - statusCode: 200
  
  # Scenario 5: Health Check
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: json